[
  {
    "slug": "himalayas",
    "title": "SkyLink in the Himalayas!",
    "date": "2025-08-14",
    "author": "",
    "cover": "/content/news/himalayas/cover.jpg",
    "description": "Our president, Aleksander Kopyto, took part in the international Spaceward Bound India Program expedition in Ladakh 🇮🇳. The mission was carried out at Tso Kar Lake, one of the world’s highest-altitude salt lakes, whose environment resembles Mars.\nDuring the fieldwork, our Ground-Penetrating Radar project was successfully deployed in the Himalayas, proving its reliability in extreme conditions and delivering valuable scientific results. This is a huge milestone for SkyLink and shows that our solutions can perform in real-world exploration missions!",
    "path": "/content/news/himalayas/"
  },
  {
    "slug": "arissSstvCertificate",
    "title": "ARISS SSTV Certificate",
    "date": "2025-07-25",
    "author": "",
    "cover": "/content/news/arissSstvCertificate/cover.jpg",
    "description": "The AGH Skylink team successfully received SSTV transmissions from the International Space Station (ISS) and was awarded an official certificate by ARISS (Amateur Radio on the International Space Station). The broadcast commemorated the 50th anniversary of the Apollo-Soyuz mission and the 40th anniversary of the first two-way SSTV communication during the STS-51F mission. The images were transmitted from the Russian segment of the ISS using an amateur radio system. We thank the ARISS organizers and mentors for this unique opportunity.",
    "path": "/content/news/arissSstvCertificate/"
  },
  {
    "slug": "eventWithSlawosz",
    "title": "Event with astronaut Sławosz Uznański-Wiśniewski",
    "date": "2025-07-22",
    "author": "",
    "cover": "/content/news/eventWithSlawosz/cover.jpg",
    "description": "AGH Skylink was invited to a special communication event with astronaut Sławosz Uznański-Wiśniewski at the Copernicus Science Centre. Our team was represented by Magdalena Nowak, 민병준, and Olek Kopyto. We conducted workshops on how CB radios work, where visitors could see their voices visualized on an oscilloscope—before and after being transformed into a radio wave. Guests also learned the basics of electronic measurements, SDR receivers, and radio modulation techniques. The youngest participants had a blast, but curious adults joined in as well!",
    "path": "/content/news/eventWithSlawosz/"
  },
  {
    "slug": "groundRadarAward",
    "title": "Ground-Penetrating Radar Award",
    "date": "2025-06-03",
    "author": "",
    "cover": "/content/news/groundRadarAward/cover.jpg",
    "description": "Our Ground-Penetrating Radar (GPR) project, designed to be mounted on a drone developed in collaboration with the Production Engineering and Energy Science Club at the University of Agriculture, won 3rd place at the URK Student Research Club Session! A great example of the power of interdisciplinary teamwork.",
    "path": "/content/news/groundRadarAward/"
  },
  {
    "slug": "conference2025",
    "title": "Space Resources Conference 2025",
    "date": "2025-05-24",
    "author": "",
    "cover": "/content/news/conference2025/cover.jpg",
    "description": "We’ve just wrapped up an inspiring experience at the Space Resources Conference (May 21–23), where we presented our project posters and connected with experts from around the world! A highlight of the event was meeting Bernard Foing, former Chief Scientist of ESA, who praised our ideas and congratulated us on the direction our student group is taking.\nPoster authors:\n- Krzysztof Rosiński, Michał Mikołajczyk, Kacper Sikora – Free Space Optical Laser Transceiver\n- Aleksander Kopyto, Sylwester Ślusarczyk, Jakub Uchacz – Development of a Ground Penetrating Radar for a Himalayan Survey Mission\n- Kacper Wojtowicz – Chronaflow: an app for subjective time perception research in Analog Astronaut Missions\nAGH SKYLINK is gaining momentum – and this is just the beginning of our cosmic journey! 🌌",
    "path": "/content/news/conference2025/"
  }
]