[
  {
    "slug": "droneDetectionSystem",
    "title": "Drone Detection System",
    "date": "",
    "tags": [
      "highlight"
    ],
    "status": "in development",
    "links": "https://skylink.agh.edu.pl/jastrzab/",
    "cover": "/content/projects/droneDetectionSystem/cover.jpg",
    "gallery": [],
    "description": "We are developing a drone detection system designed to address the growing need for protecting critical infrastructure such as ports, airports, and power lines.\nOur solution is based on passive radar technology, capable of determining a drone’s direction and velocity without emitting any active signals.\nThe system is scalable, cost-effective, and can be enhanced with laser-based modules for advanced functionality. The base configuration costs around 1000 PLN, making it significantly more affordable than existing alternatives.\nAs there are currently no similar accessible systems available in Poland, our goal is to provide an efficient and low-cost detection platform that strengthens airspace safety and supports national infrastructure protection.",
    "path": "/content/projects/droneDetectionSystem/"
  },
  {
    "slug": "groundPenetratingRadar",
    "title": "Ground-Penetrating Radar for Himalayan Research",
    "date": "",
    "tags": [],
    "status": "completed",
    "links": "",
    "cover": null,
    "gallery": [],
    "description": "Our Ground-Penetrating Radar (GPR) is designed for geological research in extreme terrains such as the Himalayas. Mounted on a drone developed in collaboration with the Production Engineering and Energy Science Club at the University of Agriculture, the radar allows analysis of subsurface structures and detection of soil layers. The project won 3rd place at the URK Scientific Societies Session, highlighting its innovation and potential for field applications. Importantly, the radar was successfully deployed during a research expedition in the Himalayas, where it proved its effectiveness and delivered valuable scientific results.",
    "path": "/content/projects/groundPenetratingRadar/"
  },
  {
    "slug": "laserCommunicationSystem",
    "title": "Laser Communication System",
    "date": "",
    "tags": [],
    "status": "completed",
    "links": "",
    "cover": null,
    "gallery": [],
    "description": "Our latest prototype is a laser-based free-space optical communication system. It uses OOK (On-Off Keying) modulation, where the signal is encoded by turning the laser diode on and off. By integrating the laser and light sensor with a microcontroller and using UART communication, we achieved a transmission speed of up to 37,500 baud. Initial tests confirmed the effectiveness of the solution, opening the way for the development of fast, wireless optical communication.",
    "path": "/content/projects/laserCommunicationSystem/"
  },
  {
    "slug": "satelliteTerminal",
    "title": "Satellite Terminal 8.8 GHz / 2.4 GHz",
    "date": "",
    "tags": [],
    "status": "in development",
    "links": "",
    "cover": "/content/projects/satelliteTerminal/cover.jpg",
    "gallery": [],
    "description": "We are working on a dual-band satellite terminal capable of operating in both the 8.8 GHz and 2.4 GHz ranges. The project aims to create a compact and efficient ground station, enabling satellite communication in various scenarios — from telemetry data transmission to long-range communication experiments. This terminal is an important step towards developing modern satellite communication technologies accessible to academic teams and research projects.",
    "path": "/content/projects/satelliteTerminal/"
  },
  {
    "slug": "stratoLink",
    "title": "StratoLink – High-Altitude Balloon Communication Platform",
    "date": "",
    "tags": [],
    "status": "in development",
    "links": "https://github.com/AGH-Skylink/StratoLink",
    "cover": null,
    "gallery": [],
    "description": "A modular communication platform for stratospheric missions. StratoLink focuses on reliable long-range telemetry and data links between a high-altitude balloon payload and a ground station, with an emphasis on robustness and extensibility.",
    "path": "/content/projects/stratoLink/"
  }
]